---
kind: type
id: T:Autodesk.Revit.DB.Structure.RebarPropagation
source: html/c3d2d1ea-47e5-12d6-40a9-25fa3cf15fb7.htm
---
# Autodesk.Revit.DB.Structure.RebarPropagation

An utility class containing functions that can be used to propagate rebar elements.

## Syntax (C#)
```csharp
public static class RebarPropagation
```